# 방 번호는 YXX 나 YYXX 형태인데 여기서 Y 나 YY 는 층 수를 나타내고 XX 는 엘리베이터에서부터 세었을 때의 번호를 나타낸다. 
# 즉, 그림 1 에서 빗금으로 표시한 방은 305 호가 된다.
# 손님은 엘리베이터를 타고 이동하는 거리는 신경 쓰지 않는다. 다만 걷는 거리가 같을 때에는 아래층의 방을 더 선호한다.
# 예를 들면 102 호 방보다는 301 호 방을 더 선호하는데, 102 호는 거리 2 만큼 걸어야 하지만 301 호는 거리 1 만큼만 걸으면 되기 때문이다. 
# 같은 이유로 102 호보다 2101 호를 더 선호한다.
# 여러분이 작성할 프로그램은 초기에 모든 방이 비어있다고 가정하에 이 정책에 따라 N 번째로 도착한 손님에게 배정될 
# 방 번호를 계산하는 프로그램이다. 첫 번째 손님은 101 호, 두 번째 손님은 201 호 등과 같이 배정한다. 
# 그림 1 의 경우를 예로 들면, H = 6이므로 10 번째 손님은 402 호에 배정해야 한다.

# 예제 입력 1 
# 2
# 6 12 10
# 30 50 72
# 예제 출력 1 
# 402
# 1203


# 내 코드 실패
# T = int(input())

# for i in range(T):
#   h,w,n = map(int, input().split())
#   floor = 0
#   room = 1
#   for j in range(n):
#     floor += 1
#     if floor >= h:
#       room +=1
#       floor = 0
#   print(floor,str(room), sep='')


t = int(input())
for i in range(t):
  h, w, n = map(int, input().split())
  f = 0
  ho = 0
  if n % h == 0:
      f = h * 100
      ho = n // h
  else:
      f = (n % h) * 100
      ho = 1 + n // h
  print(f + ho)